# Дан список чисел. Определите, сколько в нем встречается различных чисел.

list1 = [1, 1, 2, 3, 5, 5]
# функция set преобразует сисок в множество( где цифры не могут повторяться)
print(len(set(list1))) 